Revit 2027 API
StructuralAsset.YoungModulus Property
 The Young's modulus of the asset.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ YoungModulus { get; set; }
Public Property YoungModulus As XYZ
	Get
	Set
public:
property XYZ^ YoungModulus {
	XYZ^ get ();
	void set (XYZ^ value);
}
member YoungModulus : XYZ with get, set
Property Value
XYZ
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
InapplicableDataException |  When setting this property: the material type is wood. -or- When setting this property: the behavior is isotropic.
Remarks
 This property cannot be used to set the Young's modulus for wood-based and isotropic materials. For such assets, use setYoungModulus instead. The value is in Newtons per foot meter (N/(ft · m)).
See Also
Reference
StructuralAsset Class
Autodesk.Revit.DB Namespace